#+STARTUP:
*** org-agenda
#+begin_src elisp
(autoload-if-found '(org-agenda) "org-agenda" nil t)

(with-eval-after-load 'org
  (setq org-agenda-custom-commands 
        '(("x" "Unscheduled Tasks" tags-todo
           "-SCHEDULED>=\"<today>\"-DEADLINE>=\"<today>\"" nil)
          ("v" "My super agenda"
           ((agenda "" ((org-agenda-span 'day)
                        (org-super-agenda-groups
                         '((:name "Today's Log"
                                  :time-grid t
                                  :date today
                                  :scheduled today
                                  :order 1)
                           (:discard (:anything t))))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:name "今日締切のタスク"
                                   :deadline today
                                   :order 2)
                            (:name "今日予定のタスク"
                                   :scheduled today
                                   :order 3)
                            (:name "締切を過ぎたタスク"
                                   :deadline past
                                   :order 4)
                            (:name "予定が近いタスク"
                                   :deadline future
                                   :order 5)
                            (:name "研究室のTODO"
                                   :tag "Lab"
                                   :order 6)
                            (:name "RAのTODO"
                                   :tag "RA"
                                   :order 7)
                            (:name "PrivateのTODO"
                                   :tag "Private"
                                   :order 7)
                            )))))))

        org-agenda-start-on-weekday 3
        org-agenda-span 'week
        org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-agenda-include-deadlines t
        org-return-follows-link t  ;; RET to follow link
        org-agenda-time-grid
        '((daily today require-timed)
          (0900 1200 1300 1800) "......" "----------------")
        org-columns-default-format
        "%68ITEM(Task) %6Effort(Effort){:} %6CLOCKSUM(Clock){:}"
        org-clock-out-remove-zero-time-clocks t
        org-agenda-use-time-grid t
        org-clock-clocked-in-display 'both
        org-agenda-start-with-log-mode t
        org-agenda-files (list org-directory org-prj-dir)))

(plist-put org-format-latex-options :scale 1.2)
(keymap-global-set "C-c a" #'org-agenda)
#+end_src

#+RESULTS:
:results:
org-agenda
:end:

** ddskk

#+begin_src elisp
(autoload-if-found '(skk-mode) "ddskk-autoloads" nil t)

(keymap-global-set "C-x j" #'skk-mode)
(keymap-global-set "C-x C-j" #'skk-mode)
(defvar skk-azik-keyboard-specific-additional-rom-kana-rule-list
 '(("l" nil skk-toggle-characters)
              ("x@" nil skk-today)
              ("~" nil skk-set-henkan-point-subr)
              ("x~" nil "~")
              (":" nil "ー")))

(setq default-input-method "japanese-skk")
(with-eval-after-load 'skk
  (setq skk-preload t)
  (keymap-global-set "C-l" #'skk-latin-mode))

(defun skk-open-server-decoding-utf-8 ()
  "辞書サーバと接続する。サーバープロセスを返す。 decoding coding-system が euc ではなく utf8 となる。"
  (unless (skk-server-live-p)
    (setq skkserv-process (skk-open-server-1))
    (when (skk-server-live-p)
      (let ((code (cdr (assoc "euc" skk-coding-system-alist))))
	(set-process-coding-system skkserv-process 'utf-8 code))))
  skkserv-process)
(setq skk-mode-hook
      '(lambda()
         (advice-add 'skk-open-server :override 'skk-open-server-decoding-utf-8)))

(with-eval-after-load 'skk-vars
  (setq skk-jisyo
 "~/Library/Containers/net.mtgto.inputmethod.macSKK/Data/Documents/Dictionaries/skk-jisyo.utf8")
  (setq skk-large-jisyo "~/.cache/dpp/repos/github.com/skk-dev/dict/SKK-JISYO.L"
        skk-use-azik t
        skk-azik-keyboard-type "en"
        skk-server-host "localhost"
        skk-server-portnum 1178
        skk-search-katakana nil
        skk-share-private-jisyo t
        skk-save-jisyo-instantly t))

(autoload-if-found '(ddskk-posframe-mode) "ddskk-posframe" nil t)

(with-eval-after-load 'skk
  ;; hooks
  (add-hook 'skk-mode-hook #'ddskk-posframe-mode))
#+END_SRC

#+RESULTS:
:results:
(ddskk-posframe-mode (lambda nil (advice-add 'skk-open-server :override 'skk-open-server-decoding-utf-8)))
:end:

